<a href="https://colab.research.google.com/github/Juniorexz/DataScience/blob/main/Opera%C3%A7%C3%B5es.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [3]:
dados = {
     'A': np.random.randint(low = 500, high = 1500, size = 10),
     'B': np.arange(10),
     'C': np.array([1, 7, 2, 3, 11, 91, 10, 8, 54, 27]),	
     'D': np.random.randint(low = 50, high = 100, size = 10),
     'E': pd.Series([17, 19, 20, 13, 4, 11, 20, 33, 4, 7]),
     'F': [i**3 for i in range(20) if i%2!=0],
}

df = pd.DataFrame(dados)

In [4]:
df

      A  B   C   D   E     F
0  1073  0   1  50  17     1
1   706  1   7  71  19    27
2   976  2   2  63  20   125
3  1074  3   3  86  13   343
4  1113  4  11  97   4   729
5  1160  5  91  59  11  1331
6   578  6  10  86  20  2197
7  1284  7   8  81  33  3375
8  1362  8  54  87   4  4913
9   661  9  27  56   7  6859

In [24]:
df.dtypes

A          int64
B          int64
C          int64
D          int64
E          int64
F          int64
Média    float64
dtype: object

In [25]:
df['A']+df['B']

8    1446
9    1432
0    1337
3    1264
4    1116
1    1101
6    1061
2     815
5     647
7     682
dtype: int64

In [5]:
df['A']+1

0    1074
1     707
2     977
3    1075
4    1114
5    1161
6     579
7    1285
8    1363
9     662
Name: A, dtype: int64

In [27]:
df['A']/2

8    719.0
9    711.5
0    668.5
3    630.5
4    556.0
1    550.0
6    527.5
2    406.5
5    321.0
7    337.5
Name: A, dtype: float64

In [28]:
df['A']**2

8    2067844
9    2024929
0    1787569
3    1590121
4    1236544
1    1210000
6    1113025
2     660969
5     412164
7     455625
Name: A, dtype: int64

In [5]:
df['Média'] = (df['A']+df['B']+df['C'])/3

In [19]:
df

      A  B   C   D   E     F       Média
0   974  0   1  58  17     1  325.000000
1  1142  1   7  87  19    27  383.333333
2  1177  2   2  81  20   125  393.666667
3  1184  3   3  84  13   343  396.666667
4  1276  4  11  55   4   729  430.333333
5   650  5  91  97  11  1331  248.666667
6   736  6  10  64  20  2197  250.666667
7   949  7   8  94  33  3375  321.333333
8   516  8  54  76   4  4913  192.666667
9   936  9  27  83   7  6859  324.000000

In [29]:
(df['A']/df['B']/(df['E'])/df['F'])

8    0.009147
9    0.003293
0         inf
3    0.094266
4    0.095336
1    2.144250
6    0.004002
2    0.162600
5    0.008770
7    0.000866
dtype: float64

In [30]:
(df['A']-df['A'].min())/(df['A'].max()-df['A'].min()) #normalizacao

8    1.000000
9    0.981156
0    0.873116
3    0.777638
4    0.590452
1    0.575377
6    0.518844
2    0.214824
5    0.000000
7    0.041457
Name: A, dtype: float64

In [31]:

df['A'] = (df['A']-df['A'].min())/(df['A'].max()-df['A'].min())

In [32]:
df

          A  B   C   D   E     F       Média
8  1.000000  8  54  87   4  4913  500.000000
9  0.981156  9  27  93   7  6859  486.333333
0  0.873116  0   1  60  17     1  446.000000
3  0.777638  3   3  85  13   343  422.333333
4  0.590452  4  11  91   4   729  375.666667
1  0.575377  1   7  87  19    27  369.333333
6  0.518844  6  10  65  20  2197  357.000000
2  0.214824  2   2  76  20   125  272.333333
5  0.000000  5  91  82  11  1331  246.000000
7  0.041457  7   8  82  33  3375  230.000000

In [33]:
dados = {
	'A' : pd.Series([10, 20, 30, 40, 50], index = list('abcde')),
	'B' : pd.Series([17, 44, 30, 90, 100, 70, 100], index = list('abcdefg'))
}
df = pd.DataFrame(dados)

In [34]:
df['A']+df['B']

a     27.0
b     64.0
c     60.0
d    130.0
e    150.0
f      NaN
g      NaN
dtype: float64

In [36]:

dados = {
	'Marca_A': [1, 25, 99],
	'Marca_B': [90, 11, 23],
	'Marca_C' : [23, 78, 44]}
df = pd.DataFrame(data = dados, index = [2018, 2019, 2020])

In [35]:
df

      A    B
a  10.0   17
b  20.0   44
c  30.0   30
d  40.0   90
e  50.0  100
f   NaN   70
g   NaN  100

In [37]:
df.rename(
	columns = {
	'Marca_A':'Marca A',
	'Marca_B':'Marca_B',
	'Marca_C':'Marca_C'})

      Marca A  Marca_B  Marca_C
2018        1       90       23
2019       25       11       78
2020       99       23       44

In [38]:
df

      Marca_A  Marca_B  Marca_C
2018        1       90       23
2019       25       11       78
2020       99       23       44

In [39]:

df.rename(index = {2018:1, 2019:2, 2020:3})

   Marca_A  Marca_B  Marca_C
1        1       90       23
2       25       11       78
3       99       23       44

In [40]:

'Marca_A'.split('_')

['Marca', 'A']

In [41]:

"".join('Marca_A'.split('_'))

'MarcaA'

In [42]:

df.rename(columns = lambda coluna:"". join(coluna.upper().split('_')))

      MARCAA  MARCAB  MARCAC
2018       1      90      23
2019      25      11      78
2020      99      23      44

In [43]:
dados = np.random.normal(100, 5, size = (100, 3))
data = pd.DataFrame(dados, columns = list('ABC'))
df = data.copy()

In [44]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [45]:
df.drop(labels = ['B'], axis = 1) #deletando a coluna B

             A           C
0    95.035854  101.952820
1   108.241826   97.424288
2   105.467136   95.858771
3    98.967042  100.140701
4   107.213590   94.569455
..         ...         ...
95  109.261380  102.108524
96   99.847249   98.367434
97   95.430504   94.898745
98  102.277666  108.598667
99   92.496479   96.606190

[100 rows x 2 columns]

In [46]:
df.drop(labels = ['A', 'B'], axis = 1) #deletando as colunas A e B

             C
0   101.952820
1    97.424288
2    95.858771
3   100.140701
4    94.569455
..         ...
95  102.108524
96   98.367434
97   94.898745
98  108.598667
99   96.606190

[100 rows x 1 columns]

In [47]:
df.drop(labels = 'B', axis = 1, inplace = True) #deletando a coluna definitivamente

In [23]:
del df['A'] #deletando a coluna A

In [24]:

df.drop(0) # deletando a linha A

             C
1    97.691377
2   101.054158
3   101.888370
4    99.225704
5   102.739809
..         ...
95   94.709317
96  101.390194
97  103.674848
98   97.322817
99  102.166208

[99 rows x 1 columns]

In [26]:
df.head()

            A           B           C
0  103.785479   99.546572  100.729735
1  105.099292  105.827703  103.301332
2  105.290520   97.657750  106.112041
3  103.521249  102.129834   93.954630
4  104.558463   93.858423   98.501153

In [28]:
df.drop(index = [1, 2, 3], axis = 0) #deletando as linha 1, 2 e 3

             A           B           C
0   103.785479   99.546572  100.729735
4   104.558463   93.858423   98.501153
5    98.736512   94.704274   95.868114
6    96.663286  100.816942  100.217431
7    94.210710   95.215387   99.402264
..         ...         ...         ...
95  100.348622   94.959273  105.535640
96  105.334303  105.897776  100.252191
97   99.409858   96.545423   92.209655
98  105.177955  102.510286   98.228356
99   95.858776  101.687158  102.459487

[97 rows x 3 columns]

In [29]:
df.drop(index = [0, 1, 2], axis = 0) #deletando as linha 0, 1 e 2

             A           B           C
3   103.521249  102.129834   93.954630
4   104.558463   93.858423   98.501153
5    98.736512   94.704274   95.868114
6    96.663286  100.816942  100.217431
7    94.210710   95.215387   99.402264
..         ...         ...         ...
95  100.348622   94.959273  105.535640
96  105.334303  105.897776  100.252191
97   99.409858   96.545423   92.209655
98  105.177955  102.510286   98.228356
99   95.858776  101.687158  102.459487

[97 rows x 3 columns]

In [31]:

df = pd.DataFrame(np.random.normal(1, 0.5, 50).reshape(10, 5),
	columns = list('ABCDE'))

In [32]:
df

          A         B         C         D         E
0  0.549610  1.227651  1.475521  0.488430  1.237410
1  0.363682  1.728925  0.334413  0.625940  0.684853
2  0.756192  1.355779  1.793525  0.831178 -0.110004
3  0.785341  1.127522  0.795080  0.920507  1.371215
4  1.574860  1.396304  0.808104  1.011462  0.875804
5  0.743210  1.260314  0.117605  1.072175  1.009840
6  0.819622  0.699068  0.207382  1.548970  1.538966
7  1.528899  0.522512  1.371842  0.756698  1.041629
8  1.124808  2.962155  1.153631  0.263883  0.747184
9  0.601640  1.093827  1.108272  0.806587  1.262511

In [48]:
df.add_prefix(prefix = 'coluna_')

      coluna_A    coluna_C
0    95.035854  101.952820
1   108.241826   97.424288
2   105.467136   95.858771
3    98.967042  100.140701
4   107.213590   94.569455
..         ...         ...
95  109.261380  102.108524
96   99.847249   98.367434
97   95.430504   94.898745
98  102.277666  108.598667
99   92.496479   96.606190

[100 rows x 2 columns]

In [49]:
df.add_suffix(suffix = '_coluna')

      A_coluna    C_coluna
0    95.035854  101.952820
1   108.241826   97.424288
2   105.467136   95.858771
3    98.967042  100.140701
4   107.213590   94.569455
..         ...         ...
95  109.261380  102.108524
96   99.847249   98.367434
97   95.430504   94.898745
98  102.277666  108.598667
99   92.496479   96.606190

[100 rows x 2 columns]

In [37]:

serie = pd.Series([1,2,3], ['2020', '2021', '2022'])

In [38]:
serie

2020    1
2021    2
2022    3
dtype: int64

In [39]:
df.add_prefix(prefix = 'Ano')

       AnoA      AnoB      AnoC      AnoD      AnoE
0  0.549610  1.227651  1.475521  0.488430  1.237410
1  0.363682  1.728925  0.334413  0.625940  0.684853
2  0.756192  1.355779  1.793525  0.831178 -0.110004
3  0.785341  1.127522  0.795080  0.920507  1.371215
4  1.574860  1.396304  0.808104  1.011462  0.875804
5  0.743210  1.260314  0.117605  1.072175  1.009840
6  0.819622  0.699068  0.207382  1.548970  1.538966
7  1.528899  0.522512  1.371842  0.756698  1.041629
8  1.124808  2.962155  1.153631  0.263883  0.747184
9  0.601640  1.093827  1.108272  0.806587  1.262511

In [40]:
serie

2020    1
2021    2
2022    3
dtype: int64

In [41]:
df.add_prefix(prefix = 'Ano')

       AnoA      AnoB      AnoC      AnoD      AnoE
0  0.549610  1.227651  1.475521  0.488430  1.237410
1  0.363682  1.728925  0.334413  0.625940  0.684853
2  0.756192  1.355779  1.793525  0.831178 -0.110004
3  0.785341  1.127522  0.795080  0.920507  1.371215
4  1.574860  1.396304  0.808104  1.011462  0.875804
5  0.743210  1.260314  0.117605  1.072175  1.009840
6  0.819622  0.699068  0.207382  1.548970  1.538966
7  1.528899  0.522512  1.371842  0.756698  1.041629
8  1.124808  2.962155  1.153631  0.263883  0.747184
9  0.601640  1.093827  1.108272  0.806587  1.262511

In [42]:
serie

2020    1
2021    2
2022    3
dtype: int64

In [43]:
serie = pd.Series([1,2,3], [2020, 2021, 2022])

In [44]:
serie

2020    1
2021    2
2022    3
dtype: int64

In [45]:
serie.add_suffix(suffix = '_Ano')

2020_Ano    1
2021_Ano    2
2022_Ano    3
dtype: int64

NameError: ignored

In [6]:

nomes = ['Cristiane', 'Regiane', 'Diana', 'Mayumi','Stefanni']
cidades = ['Sergipe', 'Recife', 'Mato Grosso', 'Rio Grande do Sul', 'Salvador']
matematica = [7, 5, 8, 9, 6]
historia = [5, 10, 8, 6, 9]
data = {'Nome': nomes,
	'Cidade': cidades,
	'Matematica': matematica,
	'Historia': historia
  }

df = pd.DataFrame(data)

In [7]:
df

        Nome             Cidade  Matematica  Historia
0  Cristiane            Sergipe           7         5
1    Regiane             Recife           5        10
2      Diana        Mato Grosso           8         8
3     Mayumi  Rio Grande do Sul           9         6
4   Stefanni           Salvador           6         9

In [53]:
gender = ['F', 'F', 'F', 'F', 'F']#Adicionar coluna
df['Genero'] = gender

In [54]:
df

        Nome             Cidade  Matematica  Historia Genero
0  Cristiane            Sergipe           7         5      F
1    Regiane             Recife           5        10      F
2      Diana        Mato Grosso           8         8      F
3     Mayumi  Rio Grande do Sul           9         6      F
4   Stefanni           Salvador           6         9      F

In [8]:
df.insert(loc =1, column = 'Genero_', value = gender)

In [2]:
df

NameError: ignored

In [10]:
df.drop(columns = ['Genero_'], inplace = True)

In [11]:
df

        Nome             Cidade  Matematica  Historia Genero
0  Cristiane            Sergipe           7         5      F
1    Regiane             Recife           5        10      F
2      Diana        Mato Grosso           8         8      F
3     Mayumi  Rio Grande do Sul           9         6      F
4   Stefanni           Salvador           6         9      F

In [8]:
df.columns[2:3] #media

Index(['Matematica'], dtype='object')

In [15]:
df.drop(columns = ['Genero'], inplace = True)

In [9]:
df

        Nome             Cidade  Matematica  Historia
0  Cristiane            Sergipe           7         5
1    Regiane             Recife           5        10
2      Diana        Mato Grosso           8         8
3     Mayumi  Rio Grande do Sul           9         6
4   Stefanni           Salvador           6         9

In [17]:
dir(df.columns[3:])

['T',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__init__',
 '__init_subclass__',
 '__inv__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmul__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__setattr__',
 '__setitem__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_comparison_methods',
 '_add_logical_methods',
 '_add_logical_methods_disabled',
 '_add_numeric_methods',
 '_add_numeric_methods_add_sub_disabled',
 '_add_numeric_methods_binary',
 '_add_numeric_methods_disabled',
 '_add_numeric_methods_unary',
 '_assert_can_do_op',
 '_assert_can_do_setop',
 '_assert_take_fillable',
 '_attributes',
 '_can_hold_identifiers_and_holds_name',
 '_can_hold_na',
 '_can_reindex',
 '_check_indexing_error',
 '_cleanup',
 '_coerce_scalar_to_index',
 '_comparables',
 '_concat',
 '_constructor',
 '_convert_arr_indexer',
 '_convert_can_do_setop',
 '_convert_for_op',
 '_convert_index_indexer',
 '_convert_list_indexer',
 '_convert_listlike_indexer',
 '_convert_slice_indexer',
 '_convert_tolerance',
 '_defer_to_indexing',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_engine',
 '_engine_type',
 '_filter_indexer_tolerance',
 '_format_attrs',
 '_format_data',
 '_format_native_types',
 '_format_space',
 '_format_with_header',
 '_formatter_func',
 '_get_attributes_dict',
 '_get_engine_target',
 '_get_fill_indexer',
 '_get_fill_indexer_searchsorted',
 '_get_grouper_for_level',
 '_get_level_number',
 '_get_level_values',
 '_get_names',
 '_get_nearest_indexer',
 '_get_partial_string_timestamp_match_key',
 '_get_reconciled_name_object',
 '_get_string_slice',
 '_get_unique_index',
 '_get_values_for_loc',
 '_has_complex_internals',
 '_id',
 '_inner_indexer',
 '_invalid_indexer',
 '_is_comparable_dtype',
 '_is_compatible_with_other',
 '_is_memory_usage_qualified',
 '_is_numeric_dtype',
 '_is_strictly_monotonic_decreasing',
 '_is_strictly_monotonic_increasing',
 '_isnan',
 '_join_level',
 '_join_monotonic',
 '_join_multi',
 '_join_non_unique',
 '_join_precedence',
 '_left_indexer',
 '_left_indexer_unique',
 '_map_values',
 '_maybe_cast_indexer',
 '_maybe_cast_slice_bound',
 '_maybe_promote',
 '_mpl_repr',
 '_na_value',
 '_name',
 '_nan_idxs',
 '_no_setting_name',
 '_outer_indexer',
 '_reduce',
 '_reindex_non_unique',
 '_reset_cache',
 '_reset_identity',
 '_scalar_data_error',
 '_searchsorted_monotonic',
 '_set_names',
 '_shallow_copy',
 '_should_fallback_to_positional',
 '_simple_new',
 '_sort_levels_monotonic',
 '_string_data_error',
 '_summary',
 '_supports_partial_string_indexing',
 '_to_safe_for_reshape',
 '_transform_index',
 '_typ',
 '_union',
 '_union_incompatible_dtypes',
 '_validate_index_level',
 '_validate_indexer',
 '_validate_names',
 '_validate_positional_slice',
 '_validate_sort_keyword',
 '_values',
 '_wrap_joined_index',
 '_wrap_setop_result',
 'all',
 'any',
 'append',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'asi8',
 'asof',
 'asof_locs',
 'astype',
 'copy',
 'delete',
 'difference',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'duplicated',
 'empty',
 'equals',
 'factorize',
 'fillna',
 'format',
 'get_indexer',
 'get_indexer_for',
 'get_indexer_non_unique',
 'get_level_values',
 'get_loc',
 'get_slice_bound',
 'get_value',
 'groupby',
 'has_duplicates',
 'hasnans',
 'holds_integer',
 'identical',
 'inferred_type',
 'insert',
 'intersection',
 'is_',
 'is_all_dates',
 'is_boolean',
 'is_categorical',
 'is_floating',
 'is_integer',
 'is_interval',
 'is_mixed',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_numeric',
 'is_object',
 'is_type_compatible',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'join',
 'map',
 'max',
 'memory_usage',
 'min',
 'name',
 'names',
 'nbytes',
 'ndim',
 'nlevels',
 'notna',
 'notnull',
 'nunique',
 'putmask',
 'ravel',
 'reindex',
 'rename',
 'repeat',
 'searchsorted',
 'set_names',
 'shape',
 'shift',
 'size',
 'slice_indexer',
 'slice_locs',
 'sort',
 'sort_values',
 'sortlevel',
 'str',
 'symmetric_difference',
 'take',
 'to_flat_index',
 'to_frame',
 'to_list',
 'to_native_types',
 'to_numpy',
 'to_series',
 'transpose',
 'union',
 'unique',
 'value_counts',
 'values',
 'view',
 'where']

In [10]:
df.columns[2:].to_list()

['Matematica', 'Historia']

In [11]:
df.columns[2:].to_numpy() #converte para numpy

array(['Matematica', 'Historia'], dtype=object)

In [12]:
type(df.columns)

pandas.core.indexes.base.Index

In [14]:
provas = df.columns[2:].to_numpy()

In [15]:
df[provas].mean()#media colunas

Matematica    7.0
Historia      7.6
dtype: float64

In [16]:
df[provas].mean(axis = 1)#media das linhas

0    6.0
1    7.5
2    8.0
3    7.5
4    7.5
dtype: float64

In [17]:
df['Media'] = df[provas].mean(axis = 1)#media das linhas

In [18]:
def classifica_aluno(media):
  if media<7:
      return 'Reprovado'
  else:
    return 'Aprovado'

In [19]:
df['Resultado_Final'] = df['Media'].apply(classifica_aluno)

In [21]:
df

      A  B   C   D   E     F       Média
8  1438  8  54  87   4  4913  500.000000
9  1423  9  27  93   7  6859  486.333333
0  1337  0   1  60  17     1  446.000000
3  1261  3   3  85  13   343  422.333333
4  1112  4  11  91   4   729  375.666667
1  1100  1   7  87  19    27  369.333333
6  1055  6  10  65  20  2197  357.000000
2   813  2   2  76  20   125  272.333333
5   642  5  91  82  11  1331  246.000000
7   675  7   8  82  33  3375  230.000000

In [38]:
df['target'] = df['Resultado_Final'].map({'Reprovado':0,'Aprovado':1})#Map categoricas em quantitativas

In [39]:
df['Resultado_Status'] = df['Resultado_Final'].map({'Reprovado':0, 'Aprovado':1})

In [22]:
df

      A  B   C   D   E     F       Média
8  1438  8  54  87   4  4913  500.000000
9  1423  9  27  93   7  6859  486.333333
0  1337  0   1  60  17     1  446.000000
3  1261  3   3  85  13   343  422.333333
4  1112  4  11  91   4   729  375.666667
1  1100  1   7  87  19    27  369.333333
6  1055  6  10  65  20  2197  357.000000
2   813  2   2  76  20   125  272.333333
5   642  5  91  82  11  1331  246.000000
7   675  7   8  82  33  3375  230.000000

In [13]:

df.sort_values(by = ['Media'])

KeyError: ignored

In [8]:
df

      A  B   C   D   E     F       Média
0  1337  0   1  60  17     1  446.000000
1  1100  1   7  87  19    27  369.333333
2   813  2   2  76  20   125  272.333333
3  1261  3   3  85  13   343  422.333333
4  1112  4  11  91   4   729  375.666667
5   642  5  91  82  11  1331  246.000000
6  1055  6  10  65  20  2197  357.000000
7   675  7   8  82  33  3375  230.000000
8  1438  8  54  87   4  4913  500.000000
9  1423  9  27  93   7  6859  486.333333

In [9]:
df.sort_values(by = ['Média'])

      A  B   C   D   E     F       Média
7   675  7   8  82  33  3375  230.000000
5   642  5  91  82  11  1331  246.000000
2   813  2   2  76  20   125  272.333333
6  1055  6  10  65  20  2197  357.000000
1  1100  1   7  87  19    27  369.333333
4  1112  4  11  91   4   729  375.666667
3  1261  3   3  85  13   343  422.333333
0  1337  0   1  60  17     1  446.000000
9  1423  9  27  93   7  6859  486.333333
8  1438  8  54  87   4  4913  500.000000

In [10]:
df.sort_values(by = ['Média'], ascending=False)

      A  B   C   D   E     F       Média
8  1438  8  54  87   4  4913  500.000000
9  1423  9  27  93   7  6859  486.333333
0  1337  0   1  60  17     1  446.000000
3  1261  3   3  85  13   343  422.333333
4  1112  4  11  91   4   729  375.666667
1  1100  1   7  87  19    27  369.333333
6  1055  6  10  65  20  2197  357.000000
2   813  2   2  76  20   125  272.333333
5   642  5  91  82  11  1331  246.000000
7   675  7   8  82  33  3375  230.000000

In [12]:
df.sort_values(by = ['Média'], ascending=False , inplace = True)

In [14]:
df.sort_values(by = ['Média', 'A'], ascending=False)

      A  B   C   D   E     F       Média
8  1438  8  54  87   4  4913  500.000000
9  1423  9  27  93   7  6859  486.333333
0  1337  0   1  60  17     1  446.000000
3  1261  3   3  85  13   343  422.333333
4  1112  4  11  91   4   729  375.666667
1  1100  1   7  87  19    27  369.333333
6  1055  6  10  65  20  2197  357.000000
2   813  2   2  76  20   125  272.333333
5   642  5  91  82  11  1331  246.000000
7   675  7   8  82  33  3375  230.000000

In [15]:
df.sort_values(by = ['Média'], ascending=False, inplace = True)

In [20]:
df

        Nome             Cidade  Matematica  Historia  Media Resultado_Final
0  Cristiane            Sergipe           7         5    6.0       Reprovado
1    Regiane             Recife           5        10    7.5        Aprovado
2      Diana        Mato Grosso           8         8    8.0        Aprovado
3     Mayumi  Rio Grande do Sul           9         6    7.5        Aprovado
4   Stefanni           Salvador           6         9    7.5        Aprovado

In [17]:
df.sort_index() #ordenar com base no index

      A  B   C   D   E     F       Média
0  1337  0   1  60  17     1  446.000000
1  1100  1   7  87  19    27  369.333333
2   813  2   2  76  20   125  272.333333
3  1261  3   3  85  13   343  422.333333
4  1112  4  11  91   4   729  375.666667
5   642  5  91  82  11  1331  246.000000
6  1055  6  10  65  20  2197  357.000000
7   675  7   8  82  33  3375  230.000000
8  1438  8  54  87   4  4913  500.000000
9  1423  9  27  93   7  6859  486.333333

In [31]:
nomes = ['Cristiane', 'Regiane', 'Diana', 'Mayumi','Stefanni']
cidades = ['Sergipe', 'Recife', 'Mato Grosso', 'Rio Grande do Sul', 'Salvador']
portugues = [7, 5, 8, 9, 6]
fisica = [10, 5, 8, 6, 9]
data = {'Nome': nomes,
	'Cidade': cidades,
	'Portugues': portugues,
	'Fisica': fisica
  }

df = pd.DataFrame(data)

In [32]:
df

        Nome             Cidade  Portugues  Fisica
0  Cristiane            Sergipe          7      10
1    Regiane             Recife          5       5
2      Diana        Mato Grosso          8       8
3     Mayumi  Rio Grande do Sul          9       6
4   Stefanni           Salvador          6       9

In [26]:
df.columns[2:3] #media

Index(['Matematica'], dtype='object')

In [11]:
df

        Nome             Cidade  Matematica  Historia
0  Cristiane            Sergipe           7         5
1    Regiane             Recife           5        10
2      Diana        Mato Grosso           8         8
3     Mayumi  Rio Grande do Sul           9         6
4   Stefanni           Salvador           6         9

In [24]:
df.columns[2:].to_list()

['Matematica', 'Historia', 'Media', 'Resultado_Final']

In [25]:
df.columns[2:].to_numpy() #converte para numpy

array(['Matematica', 'Historia', 'Media', 'Resultado_Final'], dtype=object)

In [14]:
df.columns[2:].to_numpy() #converte para numpy

array(['Matematica', 'Historia'], dtype=object)

In [15]:
provas = df.columns[2:].to_numpy()

In [16]:
df[provas].mean()#media colunas

Matematica    7.0
Historia      7.6
dtype: float64

In [17]:
df[provas].mean(axis = 1)#media das linhas

0    6.0
1    7.5
2    8.0
3    7.5
4    7.5
dtype: float64

In [19]:
df['Media'] = df[provas].mean(axis = 1)#media das linhas

In [20]:
def classifica_aluno(media):
  if media<7:
      return 'Reprovado'
  else:
    return 'Aprovado'

In [21]:

df['Resultado_Final'] = df['Media'].apply(classifica_aluno)

In [27]:
df

        Nome             Cidade  Matematica  Historia  Media Resultado_Final
0  Cristiane            Sergipe           7         5    6.0       Reprovado
1    Regiane             Recife           5        10    7.5        Aprovado
2      Diana        Mato Grosso           8         8    8.0        Aprovado
3     Mayumi  Rio Grande do Sul           9         6    7.5        Aprovado
4   Stefanni           Salvador           6         9    7.5        Aprovado

In [22]:
df[df['Resultado_Final'] == 'Aprovado']#consultas

       Nome             Cidade  Matematica  Historia  Media Resultado_Final
1   Regiane             Recife           5        10    7.5        Aprovado
2     Diana        Mato Grosso           8         8    8.0        Aprovado
3    Mayumi  Rio Grande do Sul           9         6    7.5        Aprovado
4  Stefanni           Salvador           6         9    7.5        Aprovado

In [47]:
df['Resultado_Final'] == 'Aprovado'

0     True
1    False
2     True
3     True
4     True
Name: Resultado_Final, dtype: bool

In [28]:
#df[df['Genero'] == 'M']] #So participantes femininas alterando o filtro funciona

In [36]:
df[(df['Resultado_Final'] == 'Aprovado') & (df['Portugues']>=7)] #&: and

KeyError: ignored

In [49]:
df[(df['Resultado_Final'] == 'Aprovado') | (df['Portugues']>=7)] #or: ou

        Nome             Cidade  Portugues  Fisica  Media Resultado_Final
0  Cristiane            Sergipe          7      10    8.5        Aprovado
2      Diana        Mato Grosso          8       8    8.0        Aprovado
3     Mayumi  Rio Grande do Sul          9       6    7.5        Aprovado
4   Stefanni           Salvador          6       9    7.5        Aprovado

In [31]:
df

        Nome             Cidade  Matematica  Historia  Media Resultado_Final
0  Cristiane            Sergipe           7         5    6.0       Reprovado
1    Regiane             Recife           5        10    7.5        Aprovado
2      Diana        Mato Grosso           8         8    8.0        Aprovado
3     Mayumi  Rio Grande do Sul           9         6    7.5        Aprovado
4   Stefanni           Salvador           6         9    7.5        Aprovado

In [21]:
#df[(df['Cidade']=='Rio Grande do Sul') & (df['Media']>=7.5)] & (df['Historia']>=10)]

SyntaxError: ignored